{
  "backend/main.mo": "Main Motoko actor defining dental clinic backend with appointment management, opening hours, user profiles, and access control using mixins for storage and authorization. Includes service types, admin-only endpoints for managing hours and appointments, and public queries for clinic status.",
  "feature_evidence.json": "Feature evidence report documenting that appointments display properly in the admin panel after authentication, referencing frontend hooks and AdminPage with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files including App.tsx (router setup), Layout/Header/Footer components, HomePage, BookingPage, various sections with animations, AppointmentForm with clinic status checks, useQueries hooks requiring Internet Identity auth, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point for the Annaya Dental Care React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with routes for home, booking, services, service detail, and admin pages, wrapped in QueryClientProvider and including Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied UI component displaying a shield alert icon, error message for unauthorized admin access, and a button to return home.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with username/password inputs, loading states, error handling, and integration with useAdminAuth hook to authenticate administrators.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form with service selection, date picker (lazy-loaded Calendar), clinic status display, network connectivity checks, 30-second timeout, exponential backoff retry logic, and success/error animations. Maps user-friendly service names to backend ServiceType enum.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (location, phone, email, hours) in a card layout with icons and includes a WhatsApp button. Uses scroll animations for fade-in effects and integrates with Google Maps.",
  "frontend/src/components/DoctorsSection.tsx": "Renders a grid of doctor profile cards with avatars, names, and specializations. Each card uses scroll-triggered slide-up animations with staggered delays.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns showing clinic branding, contact details, and quick links. Includes copyright notice and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with responsive mobile menu, route and scroll-based navigation, active section highlighting, and phone number display. Handles both route changes and smooth scrolling to page sections.",
  "frontend/src/components/HeroSection.tsx": "Hero section with dual image layout featuring clinic reception area, dynamic CTA buttons based on clinic status, and status badge. Includes navigation to booking or services pages.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with Header, Footer, and Outlet for nested routes. Includes a subtle floating admin access button in the bottom-right corner.",
  "frontend/src/components/NetworkStatusIndicator.tsx": "Displays real-time network connectivity status with icons (Wifi/WifiOff/Loader) and text messages using the useNetworkStatus hook.",
  "frontend/src/components/ServicesSection.tsx": "Grid of service cards with icons, images, descriptions, and action buttons for six dental services. Features scroll animations and links to individual service detail pages.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays patient testimonials in an auto-rotating carousel with star ratings, includes a before/after treatment showcase image, and pauses autoplay on hover.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a \"Why Choose Us\" section with four feature cards (expert doctors, modern tech, emergency care, affordable pricing) and a photo gallery of clinic facilities, using scroll animations.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with React Query, creating authenticated or anonymous actors based on Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides simple admin authentication using hardcoded credentials (username: 6352174912, password: 63521) stored in sessionStorage, with login/logout functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useNetworkStatus.ts": "Monitors network connectivity status using browser online/offline events and provides a manual connectivity check function with timeout handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating appointments, user profiles, opening hours, and appointment requests from the backend actor with proper caching and error handling.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger animations when elements scroll into view, with support for reduced motion preferences and configurable thresholds.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, and keyframe animations for UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with Internet Identity authentication that displays all appointments in a filterable/sortable table and allows editing clinic opening hours.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page that displays the AppointmentForm component with a back button and checks clinic open status.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections (Hero, Services, WhyChooseUs, Doctors, Testimonials, Contact) and passes clinic open status to HeroSection.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Dynamic service detail page that displays comprehensive information about dental services including descriptions, procedures, benefits, and duration based on URL parameters.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page displaying a grid of dental service cards with icons, descriptions, images, and links to detailed service pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including color schemes using OKLCH format, typography, container queries, animations, custom shadows, and responsive breakpoints with Inter as the primary font family.",
  "project_state.json": "Project state metadata tracking an admin panel appointment management system with a known authorization bug preventing admins from viewing appointments, marked as a fix request with pending status."
}