{
  "backend/main.mo": "Main Motoko actor implementing a dental clinic management system with appointment booking, user profiles, opening hours management, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting three authentication-related features: removing multi-step verification, enforcing specific username/password credentials (6352174912/63521), and streamlining the authentication process.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing the React application structure with routing, animations, booking forms, admin access, and UI components for a dental care website.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including colors for backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Annaya Dental Care application with viewport meta tag and script reference to the React TypeScript main module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, booking, services, service details, and admin pages, wrapped with QueryClient provider and Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a shield alert icon and message for unauthorized admin access attempts with a button to return home.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component using react-hook-form for validation and useAdminAuth hook to authenticate with username/password credentials, displaying error messages for invalid attempts.",
  "frontend/src/components/AppointmentForm.tsx": "A comprehensive appointment booking form component with date/time selection, service type mapping, network status handling, and success/error states. Uses react-hook-form, lazy-loaded calendar, and integrates with backend booking mutations.",
  "frontend/src/components/ContactSection.tsx": "Displays clinic contact information (location, phone, email, hours) with WhatsApp integration and scroll animations. Uses card layout with icons for each contact method.",
  "frontend/src/components/DoctorsSection.tsx": "Showcases three dental professionals (Dr. Anas Jadla, Dr. Farhan Bangra, Dr. Jainul Aabedin) with avatars, specializations, and staggered scroll animations in a responsive grid.",
  "frontend/src/components/Footer.tsx": "Site footer with clinic branding, contact details, quick links, and attribution to caffeine.ai. Displays current year and structured in a three-column grid.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with responsive menu, route/scroll link handling, active section tracking, and mobile hamburger menu. Includes phone number and booking CTA button.",
  "frontend/src/components/HeroSection.tsx": "Dual-card hero section with reception area background image and promotional banner, featuring CTAs for booking appointments and contacting the clinic with gradient overlays.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with header, footer, outlet for nested routes, and a subtle admin access button in the bottom-right corner.",
  "frontend/src/components/NetworkStatusIndicator.tsx": "Displays real-time network connectivity status with icons (Wifi/WifiOff/Loader2) and text indicators for online, offline, and checking states.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of dental service cards (checkup, root canal, implants, whitening, braces, pediatric) with icons, images, descriptions, and links to detailed service pages and booking. Uses scroll animations and hover effects.",
  "frontend/src/components/TestimonialsSection.tsx": "Shows patient testimonials in an auto-playing carousel with 5-star ratings, includes a before/after treatment results image showcase, and pauses autoplay on hover.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Presents four key features (expert doctors, modern technology, emergency care, affordable pricing) as animated cards, plus a photo gallery of clinic facilities with hover effects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and initializing admin access control with a secret token from URL parameters.",
  "frontend/src/hooks/useAdminAuth.ts": "Manages admin authentication state using sessionStorage, providing login/logout functions with hardcoded credentials (username: 6352174912, password: 63521).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state with AuthClient and handling delegation identity validation and persistence.",
  "frontend/src/hooks/useNetworkStatus.ts": "Monitors online/offline network status using browser events and provides manual connectivity checking by fetching favicon with timeout, returning connection state and last check timestamp.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating appointment and user profile data from the backend actor, including queries for all appointments, service-filtered appointments, user profiles, clinic status, and opening hours.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to trigger animations when elements scroll into view, with support for reduced motion preferences and configurable threshold/trigger options.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, CSS custom properties for light/dark themes using OKLCH color space, and keyframe animations for fade-ins, slides, pulses, and form transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with authentication that displays all appointments in a filterable/sortable table, and provides controls for managing clinic open/closed status and opening hours for each day of the week.",
  "frontend/src/pages/BookingPage.tsx": "Simple booking page that renders the AppointmentForm component with a back button and introductory text for scheduling dental appointments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple section components (Hero, Services, WhyChooseUs, Doctors, Testimonials, Contact) into a complete homepage layout.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Dynamic service detail page that displays comprehensive information about specific dental services including descriptions, procedures, benefits, duration, and pricing, with data fetched from a local servicesData object keyed by service ID.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of dental service cards with icons, descriptions, images, and durations, each linking to detailed service pages with scroll animations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and custom shadows.",
  "project_state.json": "Project state tracking admin authentication system requirements, indicating a fix request to simplify login to username/password only without verification steps."
}