{
  "backend/main.mo": "Main Motoko actor defining appointment booking system with ServiceType variants, user profiles, and CRUD operations for appointments with role-based access control (admin/user permissions) using MixinAuthorization and MixinStorage.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features related to debugging installation errors in appointment booking, including error logging, retry logic, and authentication token handling improvements.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing the React application structure with TanStack Router, appointment booking form with enhanced error handling and retry logic, and various UI components for the dental care website.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables, plus custom animation keyframes for form entrance, error slides, success celebrations, and accessibility-aware motion settings.",
  "frontend/index.html": "Basic HTML entry point with viewport meta tag, 'Dental Care' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, services, service details, and admin pages, wrapped in QueryClientProvider and including Toaster for notifications.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with hardcoded credentials validation (username: 'ANAS', password: 'Anas@2020'), session storage authentication, and error handling with animated feedback.",
  "frontend/src/components/AppointmentForm.tsx": "React form component for booking dental appointments with date picker, service selection, and integration with backend actor for submission. Includes retry logic, validation, success states, and maps user-friendly service names to backend ServiceType enum values.",
  "frontend/src/components/ContactSection.tsx": "Contact information section displaying clinic location, phone, email, hours, and WhatsApp button with embedded Google Maps iframe. Uses scroll animations for card and map elements.",
  "frontend/src/components/DoctorsSection.tsx": "Displays a grid of three doctor profile cards (Dr. Anas Jadla, Dr. Farhan Bangra, Dr. Jainul Aabedin) with avatars, names, and specializations. Includes staggered scroll animations and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with clinic branding, contact information, quick links, and attribution to caffeine.ai. Displays current year and includes WhatsApp, phone, and email links.",
  "frontend/src/components/Header.tsx": "Sticky header navigation with mobile menu toggle, scroll-aware active section highlighting, and links to routes and scroll sections. Includes phone number display and prominent booking CTA button.",
  "frontend/src/components/HeroSection.tsx": "Hero section with dual-card layout featuring clinic scene image with primary CTA overlay and promotional banner with sky blue gradient. Includes booking and contact buttons with animations.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of dental service cards (checkup, root canal, implants, whitening, braces, pediatric) with icons, images, descriptions, and links to service detail pages and booking. Uses scroll animations and hover effects.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a carousel of patient testimonials with ratings, avatars, and auto-play functionality that pauses on hover. Displays a 4.9/5 Google rating header.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Shows four feature cards (expert doctors, modern technology, emergency care, affordable pricing) and a photo gallery of clinic equipment and patient care with scroll animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching appointments (all, by service, caller's), user profiles, and saving profiles with automatic cache invalidation. Includes exponential backoff retry logic for network errors.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger animations when elements scroll into view, with configurable threshold, trigger-once behavior, and respect for reduced motion preferences.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark theme colors using oklch color space, and includes keyframe animations for various UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays all appointments in a filterable/sortable table, handles admin authentication via AdminLoginForm, and allows admins to set up their profile name after Internet Identity login.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page that displays a header with back navigation and renders the AppointmentForm component for scheduling dental visits.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections including hero, services, why choose us, doctors, testimonials, and contact sections.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Detailed service information page that displays comprehensive descriptions, procedures, benefits, and duration for various dental services based on URL parameters, with data stored in a local servicesData object.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of dental service cards with icons, descriptions, images, and durations, each linking to detailed service pages.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with functions for persisting parameters in sessionStorage and cleaning sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH format, typography, container queries, animations, custom shadows, and keyframes for accordion animations.",
  "project_state.json": "Project state tracking file documenting a dental hospital website with features like appointment booking, service showcase, and testimonials, along with known issues including services section visibility problems, backend canister stopping, and admin panel authorization errors."
}