{
  "backend/main.mo": "Main Motoko actor implementing a dental appointment booking system with role-based access control (admin/user), appointment management, user profiles, blob storage, and various dental service types.",
  "feature_evidence.json": "Feature evidence report documenting a requirement to change admin login credentials to username 'USER' and password 'PASS', affecting the useAdminAuth.ts file.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files including components, pages, hooks, and configuration files for the Annaya Dental Care application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including color tokens for UI elements and sidebar components.",
  "frontend/index.html": "HTML entry point for the Annaya Dental Care application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, services, service details, and admin pages, wrapped with QueryClient and Toaster providers.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component using react-hook-form for validation, calling useAdminAuth hook to validate credentials and display error messages on failed authentication.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form with date picker, service selection, connection monitoring with 30-second timeout detection, and integration with backend actor for submitting appointments.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (location, phone, email, hours) in a card layout with icons and includes a WhatsApp button. Uses scroll animations for fade-in effects and includes an embedded map section.",
  "frontend/src/components/DoctorsSection.tsx": "Renders a grid of three doctor profile cards with avatars, names, and specializations. Each card uses scroll-triggered slide-up animations with staggered delays.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns showing clinic branding, contact details, and quick links. Includes copyright notice and attribution to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation menu supporting both route navigation and smooth scrolling to page sections. Includes mobile menu toggle, active section tracking, and conditional admin logout button.",
  "frontend/src/components/HeroSection.tsx": "Hero section with dual-card layout featuring a reception area image with CTA buttons and a promotional banner with sky blue gradient. Includes booking and contact action buttons with animations.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header and Footer, using Outlet for nested route rendering in a flex column structure.",
  "frontend/src/components/ServicesSection.tsx": "Displays six dental service cards in a grid with icons, images, descriptions, and action buttons. Each card has hover effects and scroll-triggered slide-up animations with staggered delays.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays patient testimonials in an auto-rotating carousel with star ratings, includes a before/after treatment image showcase, and pauses autoplay on hover.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a \"Why Choose Us\" section with four feature cards (expert doctors, modern technology, emergency care, affordable pricing) and a photo gallery of clinic facilities, using scroll animations.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity, and initializes access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides admin authentication state management using sessionStorage, with login/logout functions that validate against hardcoded credentials and extensive console logging for debugging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing AuthClient creation, login flow, identity persistence, and authentication status with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching appointments (useGetAllAppointments and useAllAppointments) with detailed logging, requiring both actor and identity to be available before executing queries.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to detect when elements enter the viewport, respecting reduced motion preferences and supporting configurable threshold, trigger-once behavior, and root margins.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark theme colors using OKLCH color space, and includes keyframe animations for UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays all appointments in a filterable/sortable table, handles Internet Identity authentication, admin authorization, and includes profile setup for first-time admin users.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page that displays a header with back navigation and renders the AppointmentForm component for scheduling dental visits.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections including hero, services, why choose us, doctors, testimonials, and contact sections.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Detailed service information page that displays comprehensive descriptions, procedures, benefits, and booking options for individual dental services using dynamic routing parameters.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of all available dental services with cards showing icons, descriptions, durations, and links to detailed service pages.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes using OKLCH format, typography, container queries, animations, custom shadows, and keyframes for accordion animations.",
  "project_state.json": "Project state tracking file documenting an admin authentication system with hardcoded USER/PASS credentials and appointment management dashboard, including existing features and pending feature requests."
}