{
  "backend/main.mo": "Motoko actor implementing appointment booking system with functions to book, retrieve all, cancel, and search appointments by service type, storing appointments in a Map with auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: DoctorsSection component creation, its integration into HomePage, HeroSection background image update, ServicesSection imagery additions, and WhyChooseUsSection photo gallery.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing setup, layout components, page components, sections, forms, hooks, and styling configuration for the dental care application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark mode color schemes using OKLCH color space, including healthcare-themed design tokens for backgrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with basic meta tags, 'Dental Care' title, root div for React mounting, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, and service detail pages, wrapped with QueryClientProvider and Toaster for global state and notifications.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form component with react-hook-form validation, service selection dropdown, date/time pickers, backend mutation integration via useActor hook, and success/error toast notifications.",
  "frontend/src/components/ContactSection.tsx": "Contact information section displaying clinic location, phone, email, hours in card format with icons, plus WhatsApp button and embedded Google Maps iframe in two-column responsive layout.",
  "frontend/src/components/DoctorsSection.tsx": "Component displaying three dental professionals (Dr. Anas Jadla, Dr. Farhan Bangra, Dr. Jainul Aabedin) in profile cards with avatars, names, specializations, and hover effects in responsive grid.",
  "frontend/src/components/Footer.tsx": "Footer component displaying clinic branding, contact information (phone, email, WhatsApp), business hours, quick links, and copyright notice in a three-column grid layout.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation menu (desktop and mobile), active section highlighting based on scroll position, phone number display, and a \"Book Appointment\" button.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, overlay gradient, headline text about dental care, and two CTA buttons for booking appointments and contacting the clinic.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying six dental service cards (checkup, root canal, implants, whitening, braces, pediatric) in a responsive grid with icons, images, descriptions, and links to detailed service pages.",
  "frontend/src/components/TestimonialsSection.tsx": "Testimonials carousel displaying patient reviews with avatars, star ratings, and text feedback, showing a 4.9/5 Google rating summary.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Section highlighting four key features (expert doctors, modern technology, emergency care, affordable pricing) with icons, plus a photo gallery showcasing clinic facilities in a three-column grid.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and context provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching appointments data: useGetAllAppointments retrieves all appointments and useSearchAppointmentsByService filters by service type.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom healthcare-themed color scheme in OKLCH format for both light and dark modes, plus base typography styles for headings.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page component displaying a back button and centered AppointmentForm with introductory text.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that renders six sections: Hero, Services, WhyChooseUs, Doctors, Testimonials, and Contact.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Service detail page displaying comprehensive information about dental services including descriptions, procedures, benefits, duration, and special features with service-specific icons and colors.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom OKLCH color system, extended typography, container settings, custom shadows, and animation keyframes for accordion and fade effects.",
  "project_state.json": "Project metadata defining a dental hospital website with US English content, architectural notes about responsive design, API integrations, service detail pages, and required professional dental imagery."
}