{
  "backend/main.mo": "Main Motoko actor implementing a dental appointment booking system with role-based access control (admin/user), appointment CRUD operations, user profiles, blob storage mixin, and 11 service types including exams, cleanings, extractions, Invisalign, and Botox consultations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components including routing, layout, pages, forms, hooks, and styling with detailed descriptions of animations, error handling, and UI features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, \"Annaya Dental Care\" title, and root div mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, booking, services list/detail, and admin pages, wrapped in QueryClientProvider and including Toaster for notifications.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with username/password validation using react-hook-form, error alerts, loading states, and integration with useAdminAuth hook for credential verification.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form with date picker, service selection dropdown mapping 16 user-friendly service names to backend ServiceType enum, retry logic with attempt tracking, comprehensive error handling for actor initialization/network issues, and success animations.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (location, phone, email, hours) in a card layout with icons and includes a WhatsApp button. Uses scroll animations and integrates with Google Maps embed.",
  "frontend/src/components/DoctorsSection.tsx": "Renders a grid of doctor profile cards with avatars, names, and specializations for three dental professionals. Each card has hover effects and staggered scroll animations.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns displaying clinic branding, contact details, and quick links. Includes copyright notice and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation menu supporting both route links and smooth scroll anchors, mobile hamburger menu, and conditional admin logout button. Tracks active section on scroll.",
  "frontend/src/components/HeroSection.tsx": "Hero section with dual-card layout featuring a reception area image with CTA buttons and a promotional banner with gradient background. Includes booking and contact actions.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header and Footer, using Outlet for nested route rendering in a flex column structure.",
  "frontend/src/components/ServicesSection.tsx": "Displays six dental service cards in a grid with icons, images, descriptions, and action buttons. Each card has hover effects and scroll animations with staggered delays.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays patient testimonials in an auto-rotating carousel with star ratings, Google rating badge, and a before/after treatment results showcase image. Includes hover-to-pause functionality for the carousel.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a 'Why Choose Us' section with four feature cards (Expert Doctors, Modern Technology, Emergency Care, Affordable Pricing) and a photo gallery showcasing clinic facilities. Uses scroll animations for staggered entrance effects.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity login state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides admin authentication functionality using sessionStorage with hardcoded credentials (ANAS/Anas@2020). Exposes login, logout, and authentication check methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Handles identity loading, login flow, and session management.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating appointment and user profile data from the backend actor. Includes retry logic with exponential backoff for handling transient errors.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to detect when elements enter the viewport, enabling scroll-triggered animations. Respects user's reduced motion preferences and supports configurable thresholds.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark themes using OKLCH color space, and includes keyframe animations for various UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays all appointments in a filterable/sortable table, handles admin authentication, and includes profile setup for first-time users. Features search by name, service type filtering, date range filtering, and appointment sorting.",
  "frontend/src/pages/BookingPage.tsx": "Simple booking page that displays the AppointmentForm component with a back button to home and introductory text about scheduling appointments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections: HeroSection, ServicesSection, WhyChooseUsSection, DoctorsSection, TestimonialsSection, and ContactSection.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Detailed service information page that displays comprehensive descriptions, procedures, benefits, duration, and special features for each dental service using data from a local servicesData object. Includes navigation to booking page.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of dental service cards with icons, descriptions, images, and durations. Each card links to its detailed service page and includes scroll animations.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, Inter font family, custom border radii, box shadows, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking file for Annaya Dental Care website showing pending admin panel features including authentication (username 'ANAS', password 'Anas@2020'), clinic schedule management, and service editing capabilities."
}