{
  "backend/main.mo": "Main backend actor implementing clinic management with appointment booking, opening hours, clinic status control (with manual override), user profiles, and role-based access control using MixinAuthorization and MixinStorage.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: fixing admin panel permission errors, adding interactive Open/Close buttons for clinic status, and integrating manual clinic status override with admin controls.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx with TanStack Router, Layout with admin access button, various page components, hooks for backend operations, and styling configurations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes, including colors for backgrounds, foregrounds, borders, and various UI elements.",
  "frontend/index.html": "HTML entry point for the Annaya Dental Care application with viewport meta tag and script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, services, service details, and admin pages, wrapped with QueryClient and Toaster providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a shield alert icon, error message for unauthorized admin access, and a button to return home.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with username/password fields, form validation using react-hook-form, error handling, and integration with useAdminAuth hook for credential validation.",
  "frontend/src/components/AppointmentForm.tsx": "A comprehensive appointment booking form component with date/time selection, service type mapping, network status handling, and success/error states. Uses react-hook-form, lazy-loaded calendar, and integrates with backend booking mutations.",
  "frontend/src/components/ContactSection.tsx": "Displays clinic contact information (location, phone, email, hours) with WhatsApp integration and scroll animations. Uses card layout with icons for each contact method.",
  "frontend/src/components/DoctorsSection.tsx": "Showcases three dental professionals with avatars, names, and specializations in a responsive grid layout. Includes scroll-triggered animations for each doctor card.",
  "frontend/src/components/Footer.tsx": "Site footer with clinic branding, contact details, quick links, and attribution to caffeine.ai. Displays current year and organized in a three-column grid layout.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with responsive menu, route and scroll-based navigation, active section tracking, and mobile hamburger menu. Includes phone number and booking CTA.",
  "frontend/src/components/HeroSection.tsx": "Dual-image hero section with reception area photo and promotional banner, featuring primary CTAs for booking appointments and contacting the clinic with gradient overlays.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with header, footer, outlet for nested routes, and a subtle admin access button in the bottom-right corner.",
  "frontend/src/components/NetworkStatusIndicator.tsx": "Displays real-time network connectivity status with icons for online, offline, and checking states using the useNetworkStatus hook.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of dental service cards (checkup, root canal, implants, whitening, braces, pediatric) with icons, images, descriptions, and links to service detail pages and booking. Uses scroll animations and hover effects.",
  "frontend/src/components/TestimonialsSection.tsx": "Shows patient testimonials in an auto-playing carousel with 5-star ratings, includes a before/after treatment results image showcase, and pauses autoplay on hover.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Presents four key features (expert doctors, modern technology, emergency care, affordable pricing) as animated cards, plus a photo gallery of clinic facilities with hover effects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and admin token initialization, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Manages admin authentication state using sessionStorage, providing login/logout functions with hardcoded credentials (username: 6352174912, password: 63521).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state with AuthClient and handling delegation validity and idle options.",
  "frontend/src/hooks/useNetworkStatus.ts": "Monitors network connectivity status using browser online/offline events and provides manual connectivity checking via HEAD request to favicon with 3-second timeout.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating appointment data, user profiles, clinic status, and opening hours using the backend actor. Includes hooks like useGetAllAppointments, useAllAppointments, useSearchAppointmentsByService, useGetCallerUserProfile, useSaveCallerUserProfile, and clinic management hooks.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to trigger animations when elements scroll into view. Supports configurable threshold, triggerOnce behavior, rootMargin, and respects user's reduced motion preferences.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for light/dark theme colors using OKLCH color space, and keyframe animations for fade-in, slide, pulse, form entrance, dropdown, calendar, and success effects.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with authentication that displays all appointments in a filterable/sortable table, allows managing clinic open/closed status, and editing opening hours for each day of the week. Includes search, date filtering, and service type filtering.",
  "frontend/src/pages/BookingPage.tsx": "Simple booking page that displays the AppointmentForm component with a back button to home and introductory text encouraging users to schedule appointments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple section components: HeroSection, ServicesSection, WhyChooseUsSection, DoctorsSection, TestimonialsSection, and ContactSection.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Dynamic service detail page that displays comprehensive information about a specific dental service including description, procedure details, benefits, duration, and special features. Uses route params to determine which service to display from a predefined servicesData object.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of service cards with icons, descriptions, images, and durations. Each card links to its detailed service page and includes scroll animations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and custom shadows for the application's design system.",
  "project_state.json": "Project state file documenting a clinic management application with known issues around admin panel permissions and missing interactive open/close controls, tracking three features to fix authentication, add control buttons, and integrate backend override functionality."
}