{
  "backend/main.mo": "Main backend actor implementing appointment booking system with authorization mixins, user profiles, and appointment CRUD operations including public booking, admin-only cancellation, and service type enumeration with text conversion.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: admin login with hardcoded credentials ('ANAS'/'Anas@2020') and protected admin dashboard route requiring authentication.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, components, pages, hooks, and styling with detailed descriptions of animations, layouts, and functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with basic meta tags, 'Dental Care' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, services, service detail, and admin pages, wrapped with QueryClient provider and Toaster for notifications.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with username/password validation using useAdminAuth hook, displaying error alerts, loading states, and triggering onLoginSuccess callback upon successful authentication.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form with date picker, service selection dropdown, patient details inputs, retry logic with exponential backoff, comprehensive error handling for installation/network issues, and success animations with confetti effect.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (location, phone, email, hours) in a card layout with icons and includes an embedded Google Maps iframe. Features scroll animations and a WhatsApp contact button.",
  "frontend/src/components/DoctorsSection.tsx": "Renders a grid of three doctor profile cards with avatars, names, and specializations. Each card has scroll-triggered animations with staggered delays and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns showing clinic branding, contact details, and quick links. Includes copyright notice and attribution to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation menu supporting both route-based and scroll-based links, mobile hamburger menu, and admin logout functionality. Tracks active section on scroll and highlights current navigation item.",
  "frontend/src/components/HeroSection.tsx": "Hero section with dual-card layout featuring a clinic scene image with call-to-action buttons and a promotional banner with sky blue gradient. Includes booking and contact navigation.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header and Footer, using TanStack Router's Outlet for page content rendering.",
  "frontend/src/components/ServicesSection.tsx": "Displays six dental service cards in a grid with icons, images, descriptions, and links to detailed service pages. Features scroll animations with staggered delays and hover effects.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays a carousel of patient testimonials with 5-star ratings, auto-scrolling every 6 seconds (paused on hover), and shows an overall 4.9/5 Google rating.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a \"Why Choose Us\" section with four feature cards (expert doctors, modern technology, emergency care, affordable pricing) and a photo gallery, using scroll animations for staggered entrance effects.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating an anonymous actor when not logged in or an authenticated actor with Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides admin authentication functionality using hardcoded credentials (ANAS/Anas@2020) with sessionStorage persistence for login state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context provider with login/logout functionality, identity management, and status tracking (initializing, idle, logging-in, success, error).",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating appointment and user profile data from the backend actor, with automatic query invalidation and exponential backoff retry logic for network errors.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to detect when an element enters the viewport, returning visibility state for triggering CSS animations while respecting user's reduced-motion preferences.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark themes using OKLCH color space, and includes animation keyframes for various UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays all appointments in a filterable/sortable table, handles admin authentication via custom hook, and includes profile setup for first-time users. Features search by patient name, service type filtering, date range filtering, and appointment sorting.",
  "frontend/src/pages/BookingPage.tsx": "Simple booking page that displays the AppointmentForm component with a back button to home and introductory text encouraging users to schedule appointments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple section components (Hero, Services, WhyChooseUs, Doctors, Testimonials, Contact) into a complete homepage layout.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Detailed service information page that displays comprehensive descriptions, procedures, benefits, duration, and features for individual dental services using data from a local servicesData object. Includes navigation back to services list and booking CTA.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of dental service cards with icons, descriptions, images, and durations. Each card links to detailed service pages and includes scroll animations.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom font families (Inter), container settings, border radius variables, custom shadows, and animation keyframes for accordion components.",
  "project_state.json": "Project state metadata for Smile Dental Care dental appointment booking system, tracking implemented features for admin authentication (hardcoded credentials: ANAS/Anas@2020) and protected dashboard routes."
}