{
  "backend/main.mo": "Main Motoko actor implementing a dental appointment booking system with role-based access control (admin/user), appointment CRUD operations, user profile management, and blob storage integration for handling patient data and service types.",
  "feature_evidence.json": "Feature evidence report documenting that the frontend correctly passes admin access tokens when initializing the actor and making getAllAppointments calls, with high confidence based on hooks and admin page implementation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, hooks, pages, and configuration files for the Annaya Dental Care booking application with animations, admin dashboard, and query management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including color tokens for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the Annaya Dental Care application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, services, service details, and admin pages, wrapped with QueryClientProvider and Toaster for notifications.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with username/password validation using react-hook-form, integrating useAdminAuth hook for credential verification and displaying error alerts on failed authentication.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form with date picker, service type selection, connection monitoring with 30-second timeout detection, actor readiness validation, and service name mapping to backend ServiceType enum before submission.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (location, phone, email, hours) with icons and a WhatsApp button. Includes scroll animations and a map embed.",
  "frontend/src/components/DoctorsSection.tsx": "Renders a grid of three doctor profile cards with avatars, names, and specializations. Uses scroll animations with staggered delays.",
  "frontend/src/components/Footer.tsx": "Footer component with clinic branding, contact details, quick links, and copyright notice including a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation menu, mobile hamburger menu, and admin logout functionality. Handles both route navigation and smooth scrolling to page sections.",
  "frontend/src/components/HeroSection.tsx": "Hero section with two side-by-side cards: one with a reception area background and CTA buttons, another with a promotional banner on sky blue gradient.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Header, Outlet for child routes, and Footer in a flex column structure.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of six dental service cards with icons, images, descriptions, and links to detailed service pages. Includes scroll animations with staggered delays.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays patient testimonials in an auto-rotating carousel with star ratings, includes a before/after treatment showcase image, and pauses autoplay on hover.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a \"Why Choose Us\" section with four feature cards (expert doctors, modern tech, emergency care, affordable pricing) and a photo gallery of clinic facilities, using scroll animations.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides admin authentication logic using hardcoded credentials (ANAS/Anas@2020) with sessionStorage persistence and extensive console logging for debugging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider using @dfinity/auth-client, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching appointments (useGetAllAppointments and useAllAppointments) with detailed console logging and actor/identity dependency checks.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger animations when elements scroll into view, with support for reduced motion preferences and configurable thresholds.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark theme colors using oklch color space, and includes keyframe animations for various UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays all appointments in a filterable/sortable table, handles Internet Identity authentication, admin authorization, and includes profile setup for first-time admin users.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page that displays a header with back navigation and renders the AppointmentForm component for scheduling dental visits.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections including hero, services, why choose us, doctors, testimonials, and contact sections into a single scrollable page.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Dynamic service detail page that displays comprehensive information about specific dental services including descriptions, procedures, benefits, duration, and booking options based on URL parameters.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of dental service cards with icons, descriptions, images, and durations, each linking to detailed service pages with scroll animations.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining theme extensions including custom colors using OKLCH color space, typography, container queries, animations, and custom shadows for a healthcare appointment booking UI.",
  "project_state.json": "Project state tracking file documenting an admin authorization bug where the backend fails to recognize an authenticated admin principal when viewing all appointments, despite frontend showing admin auth as true."
}