{
  "backend/main.mo": "Main backend actor implementing appointment booking, opening hours management, user profiles, and access control with admin-only operations for modifying hours and appointments.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to update hardcoded admin credentials in useAdminAuth hook to username '6352174912' and password '63521'.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend components including routing, layout, pages, forms, hooks, and styling with details on animations, clinic status handling, and admin authentication.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system variables for light and dark themes, including custom properties for backgrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Annaya Dental Care', and script reference to main.tsx module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, booking, services, service details, and admin pages, wrapped with QueryClient and Toaster providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a shield alert icon, error message for unauthorized admin access, and a button to return home.",
  "frontend/src/components/AdminLoginForm.tsx": "Admin login form component with username/password inputs, error handling, loading states, and integration with useAdminAuth hook for authentication.",
  "frontend/src/components/AppointmentForm.tsx": "Appointment booking form with service selection, date picker, clinic status display, network connectivity checks, retry logic, and success/error animations with service-to-backend-type mapping.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (location, phone, email, hours) with icons and a WhatsApp button, plus an embedded Google Maps iframe. Uses scroll animations for fade-in effects.",
  "frontend/src/components/DoctorsSection.tsx": "Renders a grid of three doctor profile cards with avatars, names, and specializations. Each card uses scroll-triggered slide-up animations with staggered delays.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns (branding, contact info, quick links) and a copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation links (route-based and scroll-based), mobile menu toggle, and active section highlighting. Includes phone number and booking CTA buttons.",
  "frontend/src/components/HeroSection.tsx": "Hero section with dual background images showing clinic reception and treatment areas, featuring dynamic CTAs based on clinic open/closed status and a clinic status badge.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with Header, Footer, and Outlet for nested routes. Includes a subtle fixed admin access button in the bottom-right corner.",
  "frontend/src/components/NetworkStatusIndicator.tsx": "Displays real-time network connection status with icons (Wifi/WifiOff/Loader) and text messages using the useNetworkStatus hook.",
  "frontend/src/components/ServicesSection.tsx": "Grid of six service cards (checkup, root canal, implants, whitening, braces, pediatric) with images, icons, descriptions, and links to detailed service pages. Uses scroll animations with staggered delays.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays patient testimonials in an auto-playing carousel with star ratings, includes a before/after treatment image showcase, and pauses carousel on hover.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a \"Why Choose Us\" section with four feature cards (expert doctors, modern technology, emergency care, affordable pricing) and a photo gallery of clinic facilities with scroll animations.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides simple admin authentication using hardcoded credentials (username: 6352174912, password: 63521) with sessionStorage persistence, independent of Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context provider with login/logout functionality, identity persistence, and configurable AuthClient options for ICP-based authentication.",
  "frontend/src/hooks/useNetworkStatus.ts": "Monitors network connectivity status using browser online/offline events and provides manual connectivity checking via HEAD requests to favicon.ico with timeout handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating appointment data, user profiles, and clinic settings from the backend actor with proper caching, error handling, and query invalidation.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger animations when elements scroll into view, with support for reduced motion preferences and configurable thresholds.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark theme colors using OKLCH color space, and includes animation keyframes for various UI transitions (fade-in, slide-up, pulse, etc.).",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays all appointments in a filterable/sortable table, manages clinic opening hours, and requires admin authentication via AdminLoginForm. Includes search, date filtering, and service type filtering for appointments.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page that displays the AppointmentForm component with a back button to home and checks clinic open status.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections (Hero, Services, WhyChooseUs, Doctors, Testimonials, Contact) and passes clinic open status to the hero section.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Detailed service information page that displays comprehensive descriptions, procedures, benefits, and duration for individual dental services based on URL parameters. Contains hardcoded service data for various treatments.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page that displays a grid of dental service cards with icons, descriptions, images, and links to detailed service pages using scroll animations.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system, typography, container queries, animations, custom shadows, and sidebar styling with Inter as the primary font.",
  "project_state.json": "Project state metadata tracking a fix request to update hardcoded admin credentials in the useAdminAuth hook to username '6352174912' and password '63521', with one known issue about invalid login errors."
}