{
  "kind": "build_request",
  "title": "Fix admin panel permissions and add open/close control buttons",
  "projectName": "Annaya Dental Care",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the 'You may not have the required permissions. Please contact the system administrator.' error in the admin panel by ensuring proper authentication checks and authorization flow",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin panel me ye problem aa rahi hai You may not have the required permissions. Please contact the system administrator."
        ]
      },
      "acceptanceCriteria": [
        "Admin panel loads without permission errors when accessed with valid credentials",
        "Authentication state is properly validated before rendering admin content",
        "Error message no longer appears for authenticated admin users"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add interactive Open and Close buttons in the admin panel to control clinic status, replacing the current read-only status display",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin panel me button do opne close ka sirf ststus nahi dekhna muje button chahiye taki me cuntrol kar saku"
        ]
      },
      "acceptanceCriteria": [
        "Two separate buttons labeled 'Open' and 'Close' are displayed in the admin panel",
        "Clicking 'Open' button sets clinic status to open",
        "Clicking 'Close' button sets clinic status to closed",
        "Current clinic status is visually indicated (e.g., active button highlighted or disabled)",
        "Status changes are immediately reflected in the admin panel UI"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the manual clinic status override functionality in the backend is properly integrated with the admin panel controls",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "Backend setClinicOpen and setClinicClosed functions are callable from the frontend",
        "Manual override status persists across page refreshes",
        "Status changes trigger appropriate backend state updates"
      ]
    }
  ],
  "constraints": [
    "Maintain existing admin authentication using sessionStorage with hardcoded credentials",
    "Preserve the existing ClinicStatus record structure with isOpen and manualOverride fields",
    "Keep the MixinAuthorization pattern for admin access control"
  ],
  "nonGoals": [
    "Changing the authentication credentials",
    "Modifying the overall admin panel layout",
    "Adding new clinic management features beyond open/close control"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}