{
  "kind": "build_request",
  "title": "Add dental equipment photos, patient-doctor images, and team section with 3 doctors",
  "projectName": "Satya Dental Care",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Create a new DoctorsSection component at frontend/src/components/DoctorsSection.tsx that displays three dental professionals: Dr. Anas Jadla, Dr. Farhan Bangra, and Dr. Jainul Aabedin, with professional profile cards showing their names, titles/specializations, and profile images",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add 3 doctor in other section 1sr dr. anas jadla 2nd dr farhan bangra and 3rs dr. jainul aabedin"
        ]
      },
      "acceptanceCriteria": [
        "DoctorsSection component displays exactly 3 doctor profile cards",
        "First doctor is Dr. Anas Jadla",
        "Second doctor is Dr. Farhan Bangra",
        "Third doctor is Dr. Jainul Aabedin",
        "Each card shows doctor name and a profile photo placeholder",
        "Section uses consistent styling matching the Oraa Care Smile design system"
      ]
    },
    {
      "id": "REQ-43",
      "text": "Add the DoctorsSection component to the HomePage component in frontend/src/pages/HomePage.tsx, positioned between WhyChooseUsSection and TestimonialsSection",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add 3 doctor in other section"
        ]
      },
      "acceptanceCriteria": [
        "DoctorsSection is rendered on the homepage",
        "Section appears after Why Choose Us and before Testimonials",
        "Section integrates smoothly with page flow and responsive layout"
      ]
    },
    {
      "id": "REQ-44",
      "text": "Update HeroSection component to include a background image showing dental equipment and a patient-doctor interaction scene as the hero banner background",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "bahut sare photos dal do dental machin and dental petent photo with doctor"
        ]
      },
      "acceptanceCriteria": [
        "Hero section displays a professional dental office background image",
        "Background image includes visible dental equipment",
        "Background image shows patient-doctor interaction",
        "Image maintains visual hierarchy with overlay text remaining readable"
      ]
    },
    {
      "id": "REQ-45",
      "text": "Add dental equipment and patient care imagery to the ServicesSection component, displaying relevant contextual photos within or alongside the service cards",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "bahut sare photos dal do dental machin and dental petent photo with doctor"
        ]
      },
      "acceptanceCriteria": [
        "Services section displays multiple dental equipment images",
        "At least one image shows a patient with a dentist",
        "Images are contextually relevant to the services being showcased",
        "Images maintain professional quality and healthcare aesthetic"
      ]
    },
    {
      "id": "REQ-46",
      "text": "Add a photo gallery or image showcase to the WhyChooseUsSection component showing dental machinery, clinic interior with modern equipment, and patient-doctor interactions",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "bahut sare photos dal do dental machin and dental petent photo with doctor"
        ]
      },
      "acceptanceCriteria": [
        "Why Choose Us section includes multiple professional photos",
        "Photos showcase dental equipment and technology",
        "At least one photo shows patient-doctor interaction",
        "Images support the messaging about modern technology and expert doctors"
      ]
    },
    {
      "id": "REQ-47",
      "text": "Reference all generated images as static assets from frontend/public/assets/generated directory in the respective components, ensuring proper image loading and optimization",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ]
      },
      "acceptanceCriteria": [
        "All components reference images from /assets/generated/ path",
        "Images load correctly from the public directory",
        "Image references include appropriate alt text for accessibility",
        "Images are optimized for web display with appropriate dimensions"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend/main.mo or backend architecture",
    "Do not edit immutable frontend paths: useInternetIdentity.ts, useActor.ts, main.tsx, frontend/src/components/ui",
    "Maintain the existing single-actor Motoko backend structure",
    "Keep all styling consistent with the Oraa Care Smile design system already implemented"
  ],
  "nonGoals": [
    "Adding actual doctor biography or credential details beyond names",
    "Implementing doctor scheduling or individual doctor booking flows",
    "Creating an admin panel for managing doctor profiles",
    "Adding video content or animated media",
    "Integrating with external image hosting services"
  ],
  "imageRequirements": {
    "required": [
      "Professional dental office hero banner showing modern dental equipment and a dentist consulting with a patient (hero-dental-office.dim_1920x800.png)",
      "Close-up photo of advanced dental equipment and technology in a modern clinic setting (dental-equipment-1.dim_800x600.png)",
      "Dentist examining a patient using modern dental tools (patient-doctor-exam.dim_800x600.png)",
      "Modern dental chair and equipment setup in a bright clinic room (dental-equipment-2.dim_800x600.png)",
      "Friendly dentist showing dental x-ray results to a smiling patient (patient-doctor-consultation.dim_800x600.png)",
      "Sterilization equipment and hygiene setup in dental clinic (dental-equipment-3.dim_800x600.png)",
      "Professional headshot of Dr. Anas Jadla in dental coat (doctor-anas-jadla.dim_400x400.png)",
      "Professional headshot of Dr. Farhan Bangra in dental coat (doctor-farhan-bangra.dim_400x400.png)",
      "Professional headshot of Dr. Jainul Aabedin in dental coat (doctor-jainul-aabedin.dim_400x400.png)",
      "Dental service illustration showing teeth cleaning procedure (service-cleaning.dim_600x400.png)",
      "Dental service illustration showing root canal treatment (service-root-canal.dim_600x400.png)",
      "Dental service illustration showing dental implant procedure (service-implants.dim_600x400.png)"
    ],
    "edits": []
  }
}