{
  "kind": "build_request",
  "title": "Simplify admin panel authentication to username and password only",
  "projectName": "Annaya Dental Care",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove any verification or multi-step authentication process from the admin login flow. The admin panel should authenticate using only username and password credentials.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "no veryfy only usr and pass dalo opne ho jana chahiye"
        ]
      },
      "acceptanceCriteria": [
        "Admin login form displays only username and password fields",
        "No verification step or additional authentication screens appear after entering credentials",
        "Admin panel opens immediately upon successful username/password validation"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure that admin access is granted only when both the username and password match the actual stored credentials (username: 6352174912, password: 63521). Invalid credentials should be rejected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "bur real user name and real pass ho tab hi"
        ]
      },
      "acceptanceCriteria": [
        "Login succeeds only when username exactly matches 6352174912 and password exactly matches 63521",
        "Any mismatch in username or password displays an error message",
        "Partial matches or incorrect credentials do not grant access"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Streamline the authentication process to be direct and simple with no additional processing steps or complexity beyond credential validation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "koi jyada prosses nahi"
        ]
      },
      "acceptanceCriteria": [
        "Authentication flow completes in a single step after submitting credentials",
        "No loading states, intermediate screens, or unnecessary processing delays",
        "User sees immediate feedback (success or error) after credential submission"
      ]
    }
  ],
  "constraints": [
    "Maintain the existing hardcoded credentials (username: 6352174912, password: 63521)",
    "Preserve session storage-based authentication state management",
    "Do not modify backend authentication logic"
  ],
  "nonGoals": [
    "Implementing Internet Identity integration for admin access",
    "Adding password reset or recovery functionality",
    "Creating multi-factor authentication",
    "Changing the admin credentials to different values"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}