{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Move admin panel to subtle bottom corner access",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Move admin panel link from main navigation to a subtle fixed bottom-right corner button",
      "acceptanceCriteria": [
        "Admin panel access is removed from the main header navigation",
        "A small, subtle button or icon appears fixed in the bottom-right corner of all pages",
        "The corner element is visible but designed to be inconspicuous (small size, low opacity, or minimal styling)",
        "Clicking the corner element navigates to the admin login/panel",
        "The corner element remains accessible on all viewport sizes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove the admin panel link from the main navigation menu. Identify and remove any navigation items, links, or buttons that direct users to the admin panel or admin login page from the header component."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add a fixed bottom-right corner admin access button component. Create a small, subtle button positioned with fixed positioning (bottom-right corner, e.g., bottom-4 right-4) that navigates to the admin page when clicked. The button should be rendered alongside Header, Outlet, and Footer to appear on all pages."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Style the bottom corner admin access element to be discreet with minimal visual emphasis",
      "acceptanceCriteria": [
        "The admin access element has low visual prominence (e.g., opacity 0.3-0.5 on normal state)",
        "Element size is small enough to not draw attention but large enough to be clickable",
        "On hover, the element becomes more visible to confirm it is interactive",
        "The styling matches the overall design but remains subtle"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Style the admin corner button with discreet design: use small size (e.g., w-10 h-10 or w-12 h-12), low opacity (opacity-30 to opacity-50), subtle colors that blend with the background, rounded corners, and a simple icon (e.g., settings or shield icon). Add hover state that increases opacity (hover:opacity-100) and potentially adds a subtle shadow or scale effect to confirm interactivity. Ensure the button has proper z-index to stay above other content and is touch-friendly on mobile devices."
        }
      ]
    }
  ]
}