{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin panel permissions and add open/close control buttons",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the 'You may not have the required permissions. Please contact the system administrator.' error in the admin panel by ensuring proper authentication checks and authorization flow",
      "acceptanceCriteria": [
        "Admin panel loads without permission errors when accessed with valid credentials",
        "Authentication state is properly validated before rendering admin content",
        "Error message no longer appears for authenticated admin users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Fix the authentication and authorization checks by properly handling the admin authentication state from useAdminAuth and the actor's isCallerAdmin query. Ensure that the AccessDeniedScreen is only shown when the admin is not authenticated via sessionStorage credentials, and that backend authorization checks are handled separately with appropriate error handling. Remove or adjust any conflicting authorization logic that prevents authenticated admins from accessing the panel."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useIsCallerAdmin that calls the backend isCallerAdmin method. Configure the query to handle authentication state properly and return loading/error states. This hook will be used in AdminPage to verify backend authorization status."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add interactive Open and Close buttons in the admin panel to control clinic status, replacing the current read-only status display",
      "acceptanceCriteria": [
        "Two separate buttons labeled 'Open' and 'Close' are displayed in the admin panel",
        "Clicking 'Open' button sets clinic status to open",
        "Clicking 'Close' button sets clinic status to closed",
        "Current clinic status is visually indicated (e.g., active button highlighted or disabled)",
        "Status changes are immediately reflected in the admin panel UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Replace the current read-only clinic status display with two interactive buttons labeled 'Open' and 'Close'. Implement click handlers that call the backend setClinicOpen method with true for Open and false for Close. Add visual indication of the current status by styling the active button differently (e.g., using primary color for the current state, secondary for the inactive option). Use the existing useGetClinicOpen query to display current status and invalidate the query after status changes to reflect updates immediately."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook useSetClinicOpen that calls the backend setClinicOpen method with a boolean parameter. Configure the mutation to invalidate the 'clinicOpen' query key on success to trigger an automatic refetch of the current status. Include proper error handling and success notifications using toast."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the manual clinic status override functionality in the backend is properly integrated with the admin panel controls",
      "acceptanceCriteria": [
        "Backend setClinicOpen method is callable from the frontend through the mutation hook",
        "Manual override status persists across page refreshes",
        "Status changes trigger appropriate backend state updates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Verify that the Open/Close button handlers properly call the useSetClinicOpen mutation hook and handle loading states during the mutation. Add visual feedback (loading spinner or disabled state) on buttons while the mutation is in progress. Ensure that after a successful status change, the UI reflects the persisted backend state by relying on the refetched query data."
        }
      ]
    }
  ]
}